@extends ('background')

@section('content')

<div class="group">
				<div class="left-column">
					<h1>Про нас</h1>
					Протягом багатьох років співпрацюємо тільки з перевіреними товарними знаками, а також регулярно оновлюємо свій асортимент новими, нещодавно випущеними моделями. Селекція в нашому магазині дуже ретельно і добре продумана, базується на позачасових зразках, функціональності, натуральних матеріалах та оригінальних рішеннях. Колекції складаються виключно з оригінальних моделей, асортимент яких підібраний для всіх, хто стежить за трендами та орієнтується на стиль цього сезону. Стріт стайл знаходиться сьогодні на піку популярності не лише серед молоді, а й старшого покоління за рахунок своїх практичних та стильних дизайнерських характеристик. Виробники щосезону випускають модний одяг з урахуванням трендових кольорів та стилів. Крім того, що в такому одязі та взутті ви завжди виглядатимете розкішно і стильно, практичні переваги не поступаються моді. 
			
				</div>
					<div class="right-column">
					<img class="about-us_img" src="images/image 4.png">
					</div>
					Все брендове взуття та одяг виготовляється з використанням високоякісних матеріалів та сучасних технологій, які визначають її майбутнє призначення.	
				
				</div>
				<h5>Після цілих років діяльності SNEAKER GROUP залишається сімейним бізнесом, власниками якого є два брати Єгор і Вадим.</h5>

@endsection